---
title: ViewDisplayModel
classe: Autodesk.Revit.DB.ViewDisplayModel
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ViewDisplayModel

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean EnableSilhouettes { get; set; }` | `viewDisplayModel.EnableSilhouettes` | Boolean |
| `Boolean IsValidObject { get; }` | `viewDisplayModel.IsValidObject` | Boolean |
| `ShowHiddenLinesValues ShowHiddenLines { get; set; }` | `viewDisplayModel.ShowHiddenLines` | ShowHiddenLinesValues |
| `ElementId SilhouetteEdgesGStyleId { get; set; }` | `viewDisplayModel.SilhouetteEdgesGStyleId` | ElementId |
| `Boolean SmoothEdges { get; set; }` | `viewDisplayModel.SmoothEdges` | Boolean |
| `Int32 Transparency { get; set; }` | `viewDisplayModel.Transparency` | Int32 |
| `Void Dispose()` | `viewDisplayModel.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```